src/InformationRegisters/СистемыНалогообложенияОрганизаций/СистемыНалогообложенияОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СистемыНалогообложенияОрганизаций</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>СистемаНалогообложения</name>
    <type>
      <types>EnumRef.СистемыНалогообложения</types>
    </type>
  </resources>
  <resources>
    <name>ПлательщикУСН</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПлательщикЕНВД</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПрименяетсяПатент</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбъектНалогообложения</name>
    <type>
      <types>EnumRef.ВидыОбъектовНалогообложения</types>
    </type>
  </resources>
  <resources>
    <name>СтавкаНалога</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПлательщикТорговыйСбор</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РозничнаяПродажаАлкоголя</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПовышеннаяСтавкаНалога</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрименяетсяАУСН</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПлательщикЕНП</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/УчетнаяПолитика/Module.bsl
#Область ПрограммныйИнтерфейс

// Определяет параметр Период функциональной опции, которая зависит от системы налогообложения.
//
// Параметры:
//   Организация - СправочникСсылка.Организации
//   Период - Дата - Дата, на которую требуется определить настройку системы налогообложения
//   ДатаИзменения - возвращаемое значение даты изменения системы налогообложения
//
// Возвращаемое значение:
//   Дата - Дата, приведенная к началу этого, либо прошлого месяца
//
Функция ПериодНастройкиСистемыНалогообложения(Организация, Период, ДатаИзменения = Неопределено) Экспорт
	
	// Значение Системы налогообложения записывается всегда на первое число месяца, но иногда может измениться
	// в любой день месяца. Поэтому значение Системы нужно брать за этот месяц, если изменения уже вступили в силу,
	// либо за прошлый, если не вступили.
	
	ЭтотМесяц = НачалоМесяца(Период);
	
	//ДатаИзменения = ПолучитьФункциональнуюОпцию("ДатаИзмененияСистемыНалогообложения",
	//	Новый Структура("Организация, Период", Организация, ЭтотМесяц));
	//
	// Если ДатаИзменения <> Ложь // Значение существует
	//	И (ЭтотМесяц < ДатаИзменения И ДатаИзменения < ДобавитьМесяц(ЭтотМесяц, 1)) // Система НО менялась в течение месяца
	//	И Период < ДатаИзменения Тогда // Значение еще не вступило в силу
	//	Возврат ДобавитьМесяц(ЭтотМесяц, -1); // Прошлый месяц
	//Иначе
	//	Если ДатаИзменения = Ложь Тогда
	//		ДатаИзменения = Дата(1, 1, 1); // Приведение типа
	//	КонецЕсли;
	//	Возврат ЭтотМесяц;
	//КонецЕсли;
	
	Возврат ЭтотМесяц;
	
КонецФункции

Функция ПлательщикЕНП(Организация, Период) Экспорт
	
	Если Период >= Дата(2023,1, 1) Тогда
		Результат = Истина;
	ИначеЕсли Период < Дата(2022,7, 1) Тогда
		Результат = Ложь;
	Иначе 
		СистемаНалогообложения = РегистрыСведений.СистемыНалогообложенияОрганизаций.ПолучитьПоследнее(КонецДня(Период), Новый Структура("Организация", Организация));
		
		Результат = СистемаНалогообложения.ПлательщикЕНП;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

// Возвращает признак применения системы налогообложения АУСН.
//
// Параметры:
//   Организация - СправочникСсылка.Организации - Организация
//   Период - Дата - Дата, на которую требуется определить настройку системы налогообложения
//
// Возвращаемое значение:
//   Булево - признак применения АУСН
//
Функция ПрименяетсяАУСН(Организация, Период) Экспорт
	
	СистемаНалогообложения =
		РегистрыСведений.СистемыНалогообложенияОрганизаций.ОпределитьСистемуНалогообложенияОрганизации(Организация, Период);
	Результат = СистемаНалогообложения.ПрименяетсяАУСН;
			
	Возврат Результат;
	
КонецФункции

#КонецОбласти
